Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: In this example, the admit tactic is the analogue of the sorry proof term.
ko: 이 예제에서 admit 전략은 증명항 sorry와 유사합니다.

source: In this example, the term ←h₁ instructs the rewriter to replace b with a.
ko: 이 예제에서 항 ←h₁은 b를 a로 대체하도록 다시쓰기에게 지시합니다.

source: In this example, there is only one goal after the cases tactic is applied, with h : p ∧ q replaced by a pair of assumptions, hp : p and hq : q.
ko: 이 예제에서,cases 전략이 h : p ∧ q에서 가정 hp : p과 hq : q을 적용한 이후에는 한 목표만 남습니다.

source: In this example, two types are defined simultaneously: a natural number n is Even if it is 0 or one more than an Odd number, and Odd if it is one more than an Even number.
ko: 이 예제에서 두 유형은 동시에 정의되었습니다.. 자연수 n은 만약 이것이 0 혹은 홀수(Odd)보다 하나 크면짝수(Even)입니다. 그리고 홀수(Odd)는 짝수(Even)보다 하나 큰 것입니다.

source: In this section, we describe some means that help provide structure to a tactic-style proof, making such proofs more readable and robust.
ko: 이 섹션에서 우리는 더욱 가독성있고 강건한 전략 스타일의 증명을 만들 구조를 제공하도록 돕는 몇몇 수단을 설명할 것 입니다.

source: In this section, we discuss some additional features of the proof language that are often convenient.
ko: 이 섹션에서는 종종 편리한 증명 언어의 몇 가지 추가적인 기능에 대해 설명합니다.

source: In this section, we will deal with structural recursion, in which the arguments to foo occurring on the right-hand side of the := are subterms of the patterns on the left-hand side.
ko: 이 섹션에서 우리는 구조적 재귀를 다룰 예정입니다. 여기서 foo에 대한 인수는 좌변에 대한 패턴의 부분항인 :=의 우변에서 나타납니다.

source: In this section, we will describe and explain the various extension points.
ko: 이 섹션에서 우리는 다양한 확장성에 대해 보여주고 설명할 예정입니다.

source: In type theory it is common to say motive is the motive for the elimination/recursion, since it describes the kind of object we wish to construct.
ko: 유형론에서 motive가 제거/재귀에 대한 motive다 라고 흔히 말합니다. 왜냐하면 이는 우리가 생성하고자 하는 대산의 종류를 설명하기 때문입니다.

source: In type theory, this is generally more convenient than writing Nat.add as a function that takes a pair of natural numbers as input and returns a natural number as output.
ko: 유형론에서 보통 Nat.add과 같이 쓰는 것이 자연수 쌍을 입력으로 받고 자연수를 출력으로 하는 함수로 쓰는 것보다 더 편리합니다.

source: Inaccessible Patterns
ko: 접근할 수 없는 패턴

source: Inaccessible patterns can be used to clarify and control definitions that make use of dependent pattern matching.
ko: 접근불가한 패턴은 명확성과 종속 패턴 매칭을 활용하는 정의 제어를 위해 사용될 수 있습니다.

source: Incidentally, just as False has only an elimination rule, True has only an introduction rule, True.intro : true.
ko: 참고로 False은 제거 규칙만 있듯이 True는 도입 규칙 True.intro : true만 있습니다.

source: Indeed, it is the "failure" state that causes the first combinator to backtrack and try the next tactic.
ko: 당연히 first 조합자가 원래대로 돌아와 다음 전략을 시도하도록 하는 "실패" 상태입니다.

source: Indeed, if p : Prop is any proposition, Lean's kernel treats any two elements t1 t2 : p as being definitionally equal, much the same way as it treats (fun x => t) s and t[s/x] as definitionally equal.
ko: 물론 p : Prop이 어떤 명제라면, 린의 커널은 임의의 두 원소 t2 : p 을 (fun x = t) s와 t[/x]를 정의상으로 동등하다고 같다는 것과 거의 같은 방식으로 정의상 동등하게 취급합니다.

source: Indeed, if you replace the "sorry" by an underscore in the example above, Lean will report that it is exactly this goal that has been left unsolved.
ko: 실제로 위의 예에서 "sorry"를 밑줄로 바꾸면 린은 바로 이 목표가 해결되지 않은 상태로 남아 있다고 보고합니다.

source: Indeed, in dependent type theory (and in Lean), α → β is just notation for (a : α) → β when β does not depend on a.
ko: 물론, 종속 유형론에서(그리고 Lean에서) α → β는 β가 a에 의존하지 않을 때 (a : α) → β에 대한 표기일 뿐입니다.

source: Indeed, it would defeat most of the potential benefits of ad-hoc polymorphism.
ko: 물론 이는 특수 목적 다형성의 잠재적 이점의 대부분을 좌절시킬 것입니다.

source: Inductive Families
ko: 귀납군

source: Inductively Defined Propositions
ko: 귀납적으로 정의된 명제

source: Inductively defined types can live in any type universe, including the bottom-most one, Prop.
ko: 귀납적으로 정의된 유형은 가장 바닥의 것인 Prop을 포함하는 임의의 유형 세계에 살 수 있습니다.

source: Inferring this predicate therefore requires an instance of higher-order unification.
ko: 이 술어를 추론하는 것은 그러므로 고차 통합의 개체를 요구합니다.

source: Informally, the introduction rule states:
ko: 비공식적으로 도입 규칙은 다음과 같이 말합니다.

source: Informally, you might begin a mathematical proof by saying "to prove the forward direction, unfold the definition, apply the previous lemma, and simplify." Just as these are instructions that tell the reader how to find the relevant proof, tactics are instructions that tell Lean how to construct a proof term.
ko: 비공식적으로 "앞방향으로 증명하고, 정의를 펼치고, 이전 보조 정리를 적용하고, 단순화하십시오."라고 말함으로써 수학적 증명을 시작할 수 있습니다. 이것이 독자에게 관련 증명을 찾는 방법을 알려주는 지침인 것처럼 전략은 Lean에게 증명 항를 생성하는 방법을 알려주는 지침입니다.

source: Information as to how the search path is determined can be found on the documentation pages.
ko: 어떻게 탐색경로가 결정되는지에 대한 정보는 documentation pages에서 찾아볼 수 있습니다.

source: Inheritance
ko: 상속(Inheritance)

source: Inside a tactic block, one can use the keyword conv to enter conversion mode.
ko: 전략 블록 안에서 conv 키워드를 사용하여 전환 모드로 들어갈 수 있습니다.

source: Instances which are declared last are tried first.
ko: 마지막에 선언된 개체가 가장 먼저 시도됩니다.

source: Instances declared in namespaces which are opened later are tried earlier.
ko: 이름공간에 선언된 개체는 나중에 열린 것이 더 일찍 시도됩니다.

source: Instead of zero and succ, we can use more familiar notation:
ko: zero과 succ 대신 우리는 더 친숙한 기호를 사용할 수 있습니다.

source: Instead of a single token, the notation command accepts a mixed sequence of tokens and named term placeholders with precedences, which can be referenced on the right-hand side of => and will be replaced by the respective term parsed at that position.
ko: 한 토큰 대신 notation 명령은 토큰의 혼합된 열과 이름이 붙고 우선순위가 있는 항 자리차지자를 받아들입니다. 그리고 이는=>의 우변을 참조할 수 있고 그 위치에서 구문 분석된 개별적인 항으로 대체될 것입니다.

source: Instead of using sorry, you can use an underscore _ as a placeholder.
ko: sorry를 사용하는 것 대신 밑줄 문자 _를 자리 차지자로 사용할 수 있습니다.

source: Internally, the expression have h : p := s; t produces the term (fun (h : p) => t) s.
ko: 내부적으로 표현식 have h : p := s; t은 항 (fun (h : p) => t) s을 만듭니다.

source: Introducing Auxiliary Subgoals
ko: 부가적인 하위 목표를 도입하기

source: Intuitively, Nat is the "smallest" type with these constructors, meaning that it is exhaustively (and freely) generated by starting with zero and applying succ repeatedly.
ko: 직관적으로 Nat은 이 생성자에서 "가장 작은" 유형입니다. zero으로 시작하여 succ를 반복적으로 적용함으로 남김없이 (그리고 자유롭게) 생성됨을 의미합니다.

source: Intuitively, an inductive type is built up from a specified list of constructors.
ko: 당연히 귀납형은 생성자의 명시된 리스트로부터 만들어집니다.

source: Intuitively, our proof of p → q → p assumes p and q are true, and uses the first hypothesis (trivially) to establish that the conclusion, p, is true.
ko: 직관적으로 p → q → p에 대한 우리의 증명은 p와 q가 참이라고 가정한다. 그리고 (명백히) 첫 번 째 가정을 p가 참이라는 결론을 세우기 위해 사용한다.

source: Intuitively, the constructive "Or" is very strong: asserting p ∨ q amounts to knowing which is the case.
ko: 직관적으로 구성자 "논리합"은 아주 강력합니다. p ∨ q라 주장하는 것은 각 경우를 아는 것과 같습니다.

source: Intuitively, the only way to construct a proof of Eq a x is to use reflexivity, in the case where x is a.
ko: 직관적으로 Eq a x의 증명을 생성하는 유일한 방법은 x가 a인 경우 반사성을 사용하는 것입니다.

source: It allows us to prove a proposition q from ∃ x : α, p x, by showing that q follows from p w for an arbitrary value w.
ko: 임의의 값 w에 대해 p w로부터 q임을 보임으로써 ∃ x : α, p x으로부터 명제 q를 증명하게 해줍니다.

source: It accepts the following:
ko: 이것은 다음을 받습니다.

source: It allows you to define a function by specifying equations that it should satisfy, and it allows you to prove a theorem by specifying how to handle various cases that can arise.
ko: 이는 여러분이 그것이 만족해야 하는 방정식을 명시함으로써 함수를 정의하도록 해줍니다. 그리고 이것은 일어날 수 있는 다양한 경우를 어떻게 다뤄야 하는지 나타내줌으로써 여러분이 정리를 증명하게 해줍니다.

source: It also knows a number of ways of constructing new well founded orders from others, for example, using lexicographic order.
ko: 이것도 다른 것으로부터 새로운 잘 세워진 순서를 생성하는 많은 방법을 알고 있습니다. 예를 들어 사전적 순서를 사용하는 것입니다.

source: It also makes proofs more readable.
ko: 또 이것은 증명을 더 가독성있게 만듭니다.

source: It also uses other rules that have been previously declared to the system, and applies commutativity wisely to avoid looping.
ko: 또 이것은 시스템에서 전에 선언된 적 있는 다른 규칙을 사용합니다.그리고 무한 루프를 현명하게 피하면서 교환성을 사용합니다.

source: It can even combine different relations.
ko: 심지어 이것은 다른 관계와 혼합될 수 있습니다.

source: It closes the current goal, producing the usual warning that sorry has been used.
ko: 이것은 현재 목표를 마무리 짓고, sorry를 사용했을 때처럼 경고를 만듭니다.

source: It determines the necessary case splits from the patterns that are presented to it, and raises an error if the patterns fail to exhaust the cases.
ko: 이것은 그것에 제시된 패턴에 필요한 경우를 나누는 것을 결정하고, 패턴이 경우를 처리하는데 실패하면 오류를 발생시킵니다.

source: It does not affect the code generator which compiles recursive functions as other functional programming language compilers.
ko: 다른 함수형 프로그래밍 언어의 컴파일러와 마찬가지로 이것은 재귀 함수를 컴파일하는 코드 생성기에 영향을 끼치지 않습니다.

source: It enables us to define the value of a dependent function of type (n : Nat) → C n at a particular input n in terms of all the previous values of the function, presented as an element of @Nat.below C n.
ko: 이것은 @Nat.below C n의 원소로 나타났던 함수의 모든 이전의 값들로 특정 입력 n에 대해 (n : Nat) → C n형의 종속함수의 값을 정의할 수 있게 해줍니다.

source: It falls outside the strict specification of an inductive type given in the last section because Tree does not occur strictly positively among the arguments to mk, but, rather, nested inside the List type constructor.
ko: 이것은 마지막 섹션에서 제시된 귀납형의 엄격한 명세를 바깥으로 빠져나옵니다. 왜냐하면 Tree는 mk에 대한 인수 사이에서 엄격하게 긍정적으로 일어나지 않고 대신 List형 생성자의 중첩된 안쪽에서 일어나기 때문입니다.

source: It has the important property that every assertion respects the equivalence, in the sense that we can substitute equal expressions without changing the truth value.
ko: 우리가 같은 표현식들을 진리값을 바꾸지 않고 대체할 수 있다는 점에서 등가에 대한 모든 주장은 중요한 성질이 있습니다.

source: It has a compiler that generates a binary executable and an interactive interpreter.
ko: 이것은 이진 실행 프로그램을 만드는 컴파일러와 상호작용적인 인터프리터를 갖고 있습니다.

source: It has to handle two cases: the case where the input is zero, and the case where the input is of the form succ n for some n : Nat.
ko: 이것은 입력이 zero인 경우와 입력이 어떤 n : Nat에 대해 succ n 꼴인 입력에 대한 경우 두가지를 다뤄야 합니다.

source: It has type {α : Sort u} → [i : α] → α, and is useful for triggering the type class resolution procedure when the expected type is an instance.
ko: 이것은 {α : Sort u} → [i : α] → α형이고 예상 유형이 개체일 때 유형 클래스 해결 절차를 일으키는데 유용합니다.

source: It is equivalent to first | t | skip, where skip is a tactic that does nothing (and succeeds in doing so).
ko: 이는 first | t | skip과 동일합니다. 여기서 skip은 아무것도 하지 않는(그리고 그것의 실행에서 성공하는) 전략입니다.

source: It is needed in the following example because, from a constructive standpoint, knowing that p and q are not both true does not necessarily tell you which one is false:
ko: 다음 예제에서 이게 필요한데 왜냐하면 직관주의적 관점에서 p와 q 둘 다 참이 아니라는 것을 아는 것은 여러분에게 반드시 어떤 것이 거짓이라는 것을 말해줄 필요는 없기 때문입니다.

source: It is a remarkable fact that all the basic axioms for equality follow from the constructor, refl, and the eliminator, Eq.rec.
ko: 동등성에 대한 모든 기본 공리는 생성자 refl과 제거자 Eq.rec로부터 따라 나온다는 사실은 주목할만 합니다.

source: It is also known as a recursor, and it is what makes the type "inductive": it allows us to define a function on Weekday by assigning values corresponding to each constructor.
ko: 이는 recursor로도 알려져 있고, 이게 유형을 "유도적"으로 만드는 것입니다. 이게 각 생성자에 대응하는 값을 할당함으로 Weekday에 함수를 정의할 수 있게 허용합니다.

source: It is also known as the major premise.
ko: 이것은 주요 전제로 알려져 있습니다.

source: It is also more robust than apply, since the elaborator takes the expected type, given by the target of the goal, into account when processing the expression that is being applied.
ko: 이것은 apply보다 더 강건합니다. 왜냐하면 협력기는 적용될 표현식을 처리할 때 목표의 대상에 의해 제시된 예상 유형을 받기를 기대하기 때문입니다.

source: It is an ongoing, long-term effort, and much of the potential for automation will be realized only gradually over time.
ko: 이것은 장기적으로 현재진행 중이고 자동화에 대한 대부분의 잠재성은 시간이 지나면서 점차 실현될 겁니다.

source: It is clear that cons α should have type α → List α → List α.
ko: cons α가 α → List α → List α 유형을 가져야 함은 분명합니다.

source: It is common to describe And.intro as the and-introduction rule.
ko: And.intro를 and-도입 규칙이라고 설명하는 것은 흔합니다.

source: It is common to iterate constructions like "And." Lean also allows you to flatten nested constructors that associate to the right, so that these two proofs are equivalent:
ko: "And"같은 반복적 생성은 흔합니다. 두 증명이 동등함을 보이기 위해 린은 여러분에게 오른쪽에 연관된 중첩된 생성자를 평평하게 만들도록 허용합니다.

source: It is common to use a similar trick with the List.map function, which takes a list as its second non-implicit argument:
ko: 두 번째 비암시적인 인자로써 리스트를 받는 List.map 함수로 비슷한 트릭을 쓰는 것은 흔합니다.

source: It is convenient for illustration, and we will use it often.
ko: 이는 설명에 유용하고 예제 명령을 자주 사용할 것입니다.

source: It is defined as follows:
ko: 이것은 다음과 같이 정의됩니다.

source: It is good form to use it in a tactic proof, since its failure signals that something has gone wrong.
ko: 전략 증명모드에서 이것은 사용하기에 좋은 형태입니다. 왜냐하면 그것의 실패는 무언가 잘못되었음을 알려주기 때문입니다.

source: It is just the macro.
ko: 이것은 그저 매크로입니다.

source: It is modeled after subset notation in set theory: the idea is that {x : α // p x} denotes the collection of elements of α that have property p.
ko: 집합론에서 부분집합 표기 이후에 모델되었습니다.

source: It is not hard to prove that Eq is symmetric and transitive.
ko: Eq가 대칭적이고 추이적임을 증명하는 것은 어렵지 않습니다.

source: It is often possible to bring a component of a formula outside a universal quantifier, when it does not depend on the quantified variable.
ko: 식이 정량화된 변수에 의존하지 않을 때 종종 전칭 한정기호를 식의 바깥 쪽으로 가져올 수 있습니다.

source: It is often used when we the expected type is a function type with implicit arguments, and we have a constant (reader_t.pure in the example) which also takes implicit arguments.
ko: 이것은 우리가 기대하는 유형이 암시적인 인자를 갖는 함수 유형일 때 종종 사용합니다. 그리고 우리는 암시적인 인수를 받을 수 있는 상수(예제에서 reader_t.pure)를 갖습니다.

source: It is often useful to group definitions and theorems related to a structure in a namespace with the same name.
ko: 정의들과 정리들을 같은 이름인 이름공간에 구조체와 연관지어 모으는 것이 종종 유용합니다.

source: It is remarkable that it is possible to construct a substantial edifice of mathematics based on nothing more than the type universes, dependent arrow types, and inductive types; everything else follows from those.
ko: 유형 세계, 의존 화살표 유형과 귀납형과 그들로부터 나라 나온 모든 것 외에는 아무것도 기반으로 하지 않는 수학의 실질적인 구조를 구성하는 것이 가능하다는 것은 주목할 만합니다.

source: It is represented by a metavariable, which should be instantiated later on.
ko: 이는 메타변수로 표현되며 나중에 반드시 개체화되어야 합니다.

source: It is similar to all_goals, except it fails unless its argument succeeds on at least one goal.
ko: any_goals은 그것의 인자가 적어도 한 목표에 대해서도 성공하지 않는 한 실패하는 경우를 제외하고 all_goals과 유사합니다.

source: It is sometimes useful to export aliases from one namespace to another, or to the top level.
ko: 별명을 한 이름 공간에서 다른 곳 혹은 최상위 단계로 내보내기하는 것은 때때로 유용합니다.

source: It is still tedious, however, to type all these underscores.
ko: 그래도 여전히 이 밑줄문자를 치는 것은 번거롭습니다.

source: It is the tactic analogue of a let in a proof term.
ko: 이것은 증명항에서 let과 유사한 전략입니다.

source: It is the typing rule for dependent arrow types, and the universal quantifier in particular, that distinguishes Prop from other types.
ko: 이것은 의존 화살표 유형에 대한 타자 규칙입니다. 특히 그리고 전칭 한정기호는 Prop 과 다른 유형들을 구분합니다.

source: It is useful to put such definitions into a namespace, Nat.
ko: Nat 이름공간에 그런 정의를 넣는 것은 유용합니다.

source: It just so happens that the rules for function application and abstraction can conveniently help us keep track of which elements of Prop are inhabited.
ko: 함수 적용 및 추상화 규칙이 Prop의 원소가 머무르는 것을 우리가 추적하는 것을 편리하게 도울 수 있습니다.

source: It makes functions such as compose much more convenient to write.
ko: 이것은 compose 같은 함수를 쓰기에 훨씬 더 편리하게 만듭니다.

source: It may be helpful to compare the exists-elimination rule to the or-elimination rule: the assertion ∃ x : α, p x can be thought of as a big disjunction of the propositions p a, as a ranges over all the elements of α.
ko: 존재-제거 규칙과 논리합-제거 규칙을 비교하는것은 도움이 아마 도움이 될 것입니다. 왜냐하면 a가 모든 α의 요소 범위를 갖기 때문에 명제 ∃ x : α, p x은 커다란 명제의 분리자 p a로 생각할 수 있습니다.

source: It may seem that commutativity and left-commutativity are problematic, in that repeated application of either causes looping.
ko: 둘 중 어떤 것의 반복적인 활용이 무한루프를 유발한다는 점에서 교환성과 좌교환성은 문제가 있어 보입니다.

source: It means that even though we can treat proofs t : p as ordinary objects in the language of dependent type theory, they carry no information beyond the fact that p is true.
ko: 우리가 증명t : p을 의존 유형론 언어의 평범한 대상으로 다룰 수 있음에도 p가 참이라는 사실 이상의 정보를 전달하지 않는다는 것을 의미합니다.

source: It often happens that we would like a definition to return an arbitrary element in a "corner case." For example, we may like the expression head xs to be of type a when xs is of type List a.
ko: 우리는 정의가 "막다른 경우"에 대해 임의의 원소를 반환하게 만들고 싶은 상황이 종종 있습니다. 예를 들어 xs가 List a형일 때 표현식 head xs가 a형이 되길 좋아합니다.

source: It represents the familiar pattern of an inductive proof: to prove ∀ n, motive n, first prove motive 0, and then, for arbitrary n, assume ih : motive n and prove motive (succ n).
ko: 이는 귀납적 적의의 유사한 패턴을 보여줍니다. ∀ n, motive n을 증명하기 위해 우선 motive 0을 증명하고 그 뒤 임의의 n에 대해 ih : motive n을 가정하고 motive (succ n)를 증명합니다.

source: It reverts these elements, does the split, and reintroduces them.
ko: 이것은 이 원소를 되돌리고, 나누기를 하고, 그들을 다시 도입합니다.

source: It says that if ≺ is well founded and you want to prove ∀ x, C x, it suffices to show that for an arbitrary x, if we have ∀ y ≺ x, C y, then we have C x.
ko: 이것은 만약 ≺이 잘 세워졌고 여러분이 ∀ x, C x을 증명하기 원한다고 말하면, 이는 임의의 x에 대해 우리가 ∀ y ≺ x, C y이면 C x임을 보이는 것으로 충분합니다.

source: It simply declares the type of the goal that is about to be solved, while remaining in tactic mode.
ko: 전략모드에 남아있는 동안 이것는 단순히 막 풀리려고 하는 목표의 유형을 선언합니다.

source: It supports the same options available in regular tactic mode.
ko: 보통의 전략 모드에서 사용할 수 있는 것과 동일한 옵션을 지원합니다.

source: It then does a case split on whether x is of the form zero or succ x.
ko: 그 뒤 x가 zero인지 succ x의 꼴인지에 따라 경우를 나눕니다.

source: It then reduces the goal to cases in which x is replaced by each of the constructions.
ko: 그 뒤 이것은 목표를 x는 생성자의 각각으로 대체되는 경우로 바꿉니다.

source: It then returns an output appropriate to the input.
ko: 그럼 이것은 입력에 대한 적절한 출력을 반환합니다.

source: It turns out that all commands from the first code block are in fact command macros translating to the more general notation command.
ko: 첫 번째 코드 블럭으로부터 모든 명령은 사실 macros 명령이 더 일반적인 notation명령으로 번역된 것임이 드러납니다.

source: It unifies the conclusion with the expression in the current goal, and creates new goals for the remaining arguments, provided that no later arguments depend on them.
ko: 결론을 현재 목표의 표현식과 통합하고 이후 인수가 종속되지 않는 한 나머지 인수에 대한 새 목표를 생성합니다.

source: It useful to use indendation to structure proof: every time a tactic leaves more than one subgoal, we separate the remaining subgoals by enclosing them in blocks and indenting.
ko: 구조화된 증명에 인덴트를 사용하는 것은 유용합니다. 매번 전략은 한 개 이상의 하위 목표를 남겨두므로 우리는 블럭과 인덴트로 그들을 담아 남은 하위목표와 분리할 수 있습니다.

source: It will also use an "if ... then ... else" instead of a casesOn in appropriate situations.
ko: 이것은 적절한 상황에서 casesOn 대신 "if ... then ... else"을 사용할 수도 있습니다.

source: It will unify metavariables in the conclusion if necessary:
ko: 이것은 필요하다면 결론의 메타변수들을 통합할 것 입니다.

source: It would be much nicer if the list of subtrees were given by the type List (Tree α), especially since Lean's library contains a number of functions and theorems for working with lists.
ko: 만약 하위트리의 리스트가 List (Tree α)형으로 제시된다면 훨씬 더 좋을 것입니다. 왜냐하면 특이 린의 라이브러리가 리스트와 작업할 수 있는 다수의 함수와 정리를 담고 있기 때문입니다.

source: Iterating such rewrites produces nontrivial propositional reasoning.
ko: 이 다시쓰기를 반복하는 것은 명백하지 않은 명제논리적 추론을 만들어 냅니다.

source: Its use is also not limited to propositions, though using it for data is somewhat odd:
ko: 그것의 용도는 명제에마 국한되지 않고 약간 이상하지만 데이터에 대해서도 사용됩니다.

source: Just as dependent function types (a : α) → β a generalize the notion of a function type α → β by allowing β to depend on α, dependent Cartesian product types (a : α) × β a generalize the Cartesian product α × β in the same way.
ko: 의존적 함수 유형 (a : α) → β a는 함수의 유형 α → β의 개념을 β가 α에 종속적이라고 함으로써 일반화한 것처럼 의존적 카테시안 곱 유형은 (a : α) × β a는 카테시안 곱 α × β를 같은 방식으로 일반화합니다.

source: Just as the cases tactic can be used to carry out proof by cases, the induction tactic can be used to carry out proofs by induction.
ko: cases 전략은 경우에 따른 증명을 수행하는데 사용될 수 있다. induction 전략은 귀납으로 증명을 수행하는데 사용될 수 있다.

source: Just as the constructive "or" is stronger than the classical "or," so, too, is the constructive "exists" stronger than the classical "exists".
ko: 직관주의적 "or"은 고전주의의 "or"보다 강한 것처럼 직관주의적 "존재한다"도 고전주의적 "존재한다"보다 강한 의미를 가집니다.

source: Keep in mind that the notation ∃ x : α, p is syntactic sugar for Exists (fun x : α => p).
ko: ∃ x : α, p 기호는 Exists (fun x : α => p)에 대한 문법적 설탕임을 기억하세요.

source: Keep in mind that you can use the French quotation marks in this way to refer to anything in the context, not just things that were introduced anonymously.
ko: 여러분은 프랑스 인용부호를 맥락 속에서 익명으로 도입된 것들 뿐만 아니라 어떤 것이든 참조하기 위해 사용될 수 있다는 점을 명심하세요.

source: Later, we show how you can extend the proof language using the Lean macro system.
ko: 나중에 우리는 린의 매크로 시스템을 사용해서 증명 언어를 확장하는 방법을 소개합니다.

source: Later, we will see that Inhabited is an example of a type class in Lean: Lean can be instructed that suitable base types are inhabited, and can automatically infer that other constructed types are inhabited on that basis.
ko: 나중에 우리는 Inhabited가 린에서 type class의 예임을 보게 될 것입니다. 린은 적절한 기반형이 내장됨을 알게 되면 자동적으로 다른 생성된 유형도 그 기저에 내장되었음을 추론할 수 있습니다.

source: Lean detects when these arguments can be inferred from later arguments to a constructor or the return type, and makes them implicit in that case.
ko: 린은 이 인수가 생성자의 나중 인수나 반환형으로부터 추론될 수 있을 때를 감지하고 그 경우 이들을 암시적이게 만듭니다.

source: Lean simply normalizes these expressions until the constructors zero and succ are exposed.
ko: 린은 단순히 이 표현식들을 생성자 zero과 succ이 드러날 때까지 정규화합니다.

source: Lean therefore provides Or.inr and Or.inl which can be viewed as shorthand for Or.intro_right _ and Or.intro_left _.
ko: 린은 그러므로 Or.intro_right _과 Or.intro_left _의 약식 표현으로 볼 수 있는 Or.inr 과 Or.inl을 제공합니다.

source: Lean 4 supports a new feature called auto bound implicit arguments.
ko: 린 4는 auto bound implicit arguments라 하는 새로운 기능을 지원합니다.

source: Lean allows us to use anonymous constructor notation ⟨arg1, arg2, ...⟩ in situations like these, when the relevant type is an inductive type and can be inferred from the context.
ko: 연관된 유형이 귀납형이고 맥락으로부터 추리할 수 있는 상황에서 린은 익명 생성자 표기 ⟨arg1, arg2, ...⟩를 쓸 수 있게 해줍니다.

source: Lean allows users to mark such subterms as inaccessible for pattern matching.
ko: 린은 사용자가 그런 부분항을 패턴 매칭에 대해 inaccessible으로 표시하도록 허용합니다.

source: Lean allows you to specify that unassigned fields in the specification of a record should be taken from a previously defined structure object s by adding the annotation s with before the field assignments.
ko: 린은 여러분이 레코드의 명세에서 이전에 정의된 구조체 개체로부터 s를 받아 필드 할당 전에 s가 있음 주석을 추가하여 할당되지 않은 필드를 나타내도록 해줍니다.

source: Lean also allows us to specify the type of the final term hp, explicitly, with a show statement.
ko: 린은 여러분에게 마지막 항 hp을 명시적으로 show 문장으로 유형을 명시하는 것을 허용합니다.

source: Lean also allows parameters to occur after :, but it cannot pattern match on them.
ko: 린은 매개변수가 : 뒤에서 나타나는 것도 허용합니다. 그러나 이들에 대해 패턴 매칭은 할 수 없습니다.

source: Lean also allows you to introduce "local" definitions using the let keyword.
ko: Lean은 여러분이 let 키워드를 사용해 "지역" 정의를 가져올 수 있게 허용합니다.

source: Lean also has a let tactic, which is similar to the have tactic, but is used to introduce local definitions instead of auxiliary facts.
ko: Lean은 또 have전략과 유사한 let 전략을 갖고 있습니다. 그러나 이것은 부가적인 사실 대신 지역 정의를 도입하는데 사용됩니다.

source: Lean also has mechanisms to serve as its own metaprogramming language, which means that you can implement automation and extend the functionality of Lean using Lean itself.
ko: 또한 Lean은 그 자체로 메타프로그래밍 언어로 기능하는 작동 원리가 있어 자동화의 수행 및 Lean 자체로 그 기능을 확장할 수 있음을 의미합니다.

source: Lean also provides the "bullet" notation .
ko: 린은 또 구조화한 증명에 대해 "bullet" 기호를 제공합니다.

source: Lean also provides a compiler for match-with expressions found in many functional languages.
ko: 린도 많은 함수형 언어에서 발견되다시피 컴파일러에게 match-with 표현식을 줍니다.
